/*
 * @Descripttion: 
 * @Author: jiegiser
 * @Date: 2020-03-04 07:57:25
 * @LastEditors: jiegiser
 * @LastEditTime: 2020-03-05 08:49:52
 */
import React, { Component } from 'react'
import {
  DetailWrapper,
  Header,
  Content
} from './style'
class Detail extends Component {
  render() {
    return (
      <DetailWrapper>
        <Header>“你未婚同居，没有资格要彩礼，爱嫁不嫁”媳妇反击，婆婆无言</Header>
        <Content>
          <img alt="" src="http://upload-images.jianshu.io/upload_images/8494499-0f50889c21dc82bf?imageMogr2/auto-orient/strip|imageView2/2/w/575/format/webp" />
          <p>我和男朋友确认关系后，就住在了一起。<b>因为我们首先是奔着结婚去的，是真心想要结婚，不是那种玩玩的心态。</b>
              愿意同居也是为以后结婚考虑，都说了解一个人最快的方法，就是住在一起，男朋友没有反对，我也没有反对。
              同居三年，好在男朋友对我一直不错，我们也终于把结婚定好了日子。
              我们结婚不需要担心房子的问题，因为在我刚参加工作不久，父母就在我工作的城市，为我买了一套结婚的房子。
          </p>
          <p>我和男朋友确认关系后，就住在了一起。因为我们首先是奔着结婚去的，是真心想要结婚，不是那种玩玩的心态。
              愿意同居也是为以后结婚考虑，都说了解一个人最快的方法，就是住在一起，男朋友没有反对，我也没有反对。
              同居三年，好在男朋友对我一直不错，我们也终于把结婚定好了日子。
              我们结婚不需要担心房子的问题，因为在我刚参加工作不久，父母就在我工作的城市，为我买了一套结婚的房子。
          </p>
          <p>我和男朋友确认关系后，就住在了一起。因为我们首先是奔着结婚去的，是真心想要结婚，不是那种玩玩的心态。
              愿意同居也是为以后结婚考虑，都说了解一个人最快的方法，就是住在一起，男朋友没有反对，我也没有反对。
              同居三年，好在男朋友对我一直不错，我们也终于把结婚定好了日子。
              我们结婚不需要担心房子的问题，因为在我刚参加工作不久，父母就在我工作的城市，为我买了一套结婚的房子。
          </p>
          <p>我和男朋友确认关系后，就住在了一起。因为我们首先是奔着结婚去的，是真心想要结婚，不是那种玩玩的心态。
              愿意同居也是为以后结婚考虑，都说了解一个人最快的方法，就是住在一起，男朋友没有反对，我也没有反对。
              同居三年，好在男朋友对我一直不错，我们也终于把结婚定好了日子。
              我们结婚不需要担心房子的问题，因为在我刚参加工作不久，父母就在我工作的城市，为我买了一套结婚的房子。
          </p>
          <p>我和男朋友确认关系后，就住在了一起。因为我们首先是奔着结婚去的，是真心想要结婚，不是那种玩玩的心态。
              愿意同居也是为以后结婚考虑，都说了解一个人最快的方法，就是住在一起，男朋友没有反对，我也没有反对。
              同居三年，好在男朋友对我一直不错，我们也终于把结婚定好了日子。
              我们结婚不需要担心房子的问题，因为在我刚参加工作不久，父母就在我工作的城市，为我买了一套结婚的房子。
          </p>
          <p>我和男朋友确认关系后，就住在了一起。因为我们首先是奔着结婚去的，是真心想要结婚，不是那种玩玩的心态。
              愿意同居也是为以后结婚考虑，都说了解一个人最快的方法，就是住在一起，男朋友没有反对，我也没有反对。
              同居三年，好在男朋友对我一直不错，我们也终于把结婚定好了日子。
              我们结婚不需要担心房子的问题，因为在我刚参加工作不久，父母就在我工作的城市，为我买了一套结婚的房子。
          </p>
        </Content>
      </DetailWrapper>
    )
  }
}

export default Detail